pkg/wsman/wsmantesting/responses/cim/boot/sourcesetting/get.xml

<?xml version="1.0" encoding="UTF-8"?>
<a:Envelope xmlns:a="http://www.w3.org/2003/05/soap-envelope"
    xmlns:b="http://schemas.xmlsoap.org/ws/2004/08/addressing"
    xmlns:c="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd"
    xmlns:d="http://schemas.xmlsoap.org/ws/2005/02/trust"
    xmlns:e="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
    xmlns:f="http://schemas.dmtf.org/wbem/wsman/1/cimbinding.xsd"
    xmlns:g="http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/CIM_BootSourceSetting"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <a:Header>
        <b:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</b:To>
        <b:RelatesTo>0</b:RelatesTo>
        <b:Action a:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/09/transfer/GetResponse</b:Action>
        <b:MessageID>0</b:MessageID>
        <c:ResourceURI>http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/CIM_BootSourceSetting</c:ResourceURI>
    </a:Header>
    <a:Body>
        <g:CIM_BootSourceSetting>
            <g:ElementName>Intel(r) AMT: Boot Source</g:ElementName>
            <g:FailThroughSupported>2</g:FailThroughSupported>
            <g:InstanceID>Intel(r) AMT: Force Hard-drive Boot</g:InstanceID>
            <g:StructuredBootString>CIM:Hard-Disk:1</g:StructuredBootString>
        </g:CIM_BootSourceSetting>
    </a:Body>
</a:Envelope>